// Localized application name
"applicationName" = "Android File Transfer";

// The title of the filename column when viewing a device's files.
"filenameColumnHeaderTitle" = "Name";
// The title of the column which shows the last modification date of a device's files.
"lastModifiedColumnHeaderTitle" = "Last Modified";
// The title of the column which shoes the file size of a device's files.
"sizeColumnHeaderTitle" = "Size";
// The title of a button which, when pressed, creates a new folder on the device.
"newFolderButtonText" = "New folder";
// The title of a button which, when pressed, deleted the selected files on the device.
"deleteButtonText" = "Delete";

// The title of the window showing the status of copying files to or from the device.
"copyStatusWindowTitle" = "Copy";

// Text shown on a button which cancels an operation.
"cancelButton" = "Cancel";

// String shown in progress after the user has canceled the transfer, while it is still being
// canceled.
"cancelingLabel" = "Canceling";
// String shown in progress while still preparing to start the transfer.  The placeholder is
// the name of the folder being copied to.
"preparingToCopyLabel" = "Preparing to copy to \"%@\"";
// String shown in progress while copying multiple items. The first placeholder is the number of
// items still being copied, and will always be at least 2.  The second placeholder is the name
// of the folder being copied to.
"copyingMultipleItemsLabel" = "Copying %1$d items to \"%2$@\"";
// String shown when a single item is being copied.  The first placeholder is the filename of the
// item being copied, and the second placeholder is the name of the folder being copied to.
"copyingSingleItemLabel" = "Copying \"%1$@\" to \"%2$@\"";

// String shown during a copy while the time remaining is still being calculated.
"timeRemainingUnknown" = "Estimating time remaining...";
// String showing progress of a copy operation.
"timeRemainingLessThan5Seconds" = "Less than 5 seconds remaining";
// String showing progress of a copy operation.
"timeRemainingLessThan15Seconds" = "Less than 15 seconds remaining";
// String showing progress of a copy operation.
"timeRemainingLessThan30Seconds" = "Less than 30 seconds remaining";
// String showing progress of a copy operation.
"timeRemaining1Minute" = "About 1 minute remaining";
// String showing progress of a copy operation.  The placeholder will be replaced
// with the number of minutes remaining, from 2-60.
"timeRemainingMinutes" = "About %1$d minutes remaining";
// String showing progress of a copy operation.
"timeRemaining1Hour" = "About 1 hour remaining";
// String showing progress of a copy operation.  The placeholder will be replaced
// with the number of hours remaining, always at least 2.
"timeRemainingHours" = "About %1$d hours remaining";

// String format used to indicate how a copy is proceeding.  First placeholder is the number of
// bytes already copied, second is the total number in this copy, and the third is an estimate of
// the remaining time.
"bottomProgressStringFormat" = "%1$@ of %2$@ - %3$@";

// Default name of a newly created folder.
"folderDefaultName" = "untitled folder";

// Status shown at the bottom of the folder view when items are selected.  First placeholder is the
// number of items selected, second is the total number of items shown.  Third placeholder is the
// amount of free space remaining on the device.
"bottomStatusFilesSelected" = "%1$d of %2$d selected, %3$@ available";
// Status shown on the bottom of the folder view when there is a single item.  Placeholder is the
// amount of free space remaining on the device.
"bottomStatusNoSelectionSingleItem" = "1 item, %1$@ available";
// Status shown on the bottom of the folder view when there are multiple items.  First placeholder
// is the number of items shown (always at least 2), second placeholder is the amount of free space
// remaining on the device.
"bottomStatusNoSelectionMultipleItems" = "%1$d items, %2$@ available";

// Error message shown when there was a problem deleting a file.
"errorDeletingTitle" = "Error while deleting";
// Error description shown when there was a problem deleting a file.  Placeholder is replaced
// with the name of the file.
"errorDeletingDescription" = "Could not delete file or folder named \"%@\"";
// Error message shown when there was a problem creating a foder.
"errorCreateFolderTitle" = "Could not create folder";
// Error message shown when there was a problem connecting to a plugged in device.
"errorConnectToDeviceTitle" = "Could not connect to device";
// Error message shown when there was a problem connecting to a plugged in device.
"errorCommunicatingWithDeviceTitle" = "Could not communicate with device";
// Error message shown when there was a problem getting device info.
"errorUnlockDeviceTitle" = "Can't access device storage";
// Error message shown when there was a problem renaming a folder.
"errorRenameFolderTitle" = "Could not rename folder";
// Error message shown when there was a problem renaming a file.
"errorRenameFileTitle" = "Could not rename file";
// Error message shown when there was a problem copying a file.
"errorCopyingFileTitle" = "Could not copy file";
// Error message shown when there was a problem replacing a file.
"errorReplacingFileTitle" = "Could not replace file";
// Error description shown where there was a problem copying a file.  Placeholder is replaced
// with the name of the file that was being copied.
"errorCopyingFileDescription" = "Could not copy file \"%@\"";
// Error title shown when a user attempts to open a file.
"errorCannotOpenFileTitle" = "Android File Transfer cannot open files.";
// Error title shown when a user attempts to open a file.
"errorCannotOpenFileDescription" = "To open a file, move it to your computer first.";
// Error title shown when a user attempts to open a file.
"errorCannotOpenMultipleTitle" = "Android File Transfer cannot open multiple items.";
// Error title shown when a user attempts to open a file.
"errorCannotOpenNoneTitle" = "No item selected to open.";
// Error title shown when a user attempts to open a file.
"errorCannotOpenBadSelectionDescription" = "Select a single item and try again.";
// Error description for when there was no detected error.  This message should never be shown.
"errorSuccessDescription" = "No error";
// Error description when an operation failed because the filename does not exist.
"errorPathNotFoundDescription" = "No item exists with that name";
// Error description shown when an operation failed because the device was not initialized.
"errorDeviceNotInitializedDescription" = "The device is not initialized.  Try reconnecting or restarting your device";
// Error description shown when an operation failed because the name already exists.
"errorPathAlreadyExistsDescription" = "A file or folder with that name already exists";
// Error description shown when the user attempts to access a storage volume which no longer
// exists, like if the user pulled an SD card from the device while this application is running.
"errorInvalidStorageDescription" = "Could not find the selected storage.";
// Generic error description, used when we don't have other suggestions or details from an operation
// which failed.
"errorGenericDescription" = "Try reconnecting or restarting your device.";
// Error description shown when we can't get the storage for the device.
"errorUnlockDescription" = "If your device's screen is locked, disconnect its USB cable, unlock your screen, and then reconnect the USB cable.";
// Warning title shown when a file or folder already exists.  Placeholder is replaced with the file name.
"warningFileExistsMessage" = "An item named \"%@\" already exists in this folder.";
// Warning description shown when a file already exists, and the user may choose to replace it.
"warningFileExistsInformative" = "Would you like to replace the existing item with the one being copied?";
// Button on warning which allows the user to replace (overwrite) a file or folder.
"warningFileExistsReplace" = "Replace";
// Button on warning which allows the user to skip copying a file when one already exists with that name.
"warningFileExistsSkip" = "Skip";
// Button on warning which allows the user to replace (overwrite) all files or folders in a copy operation.
"warningFileExistsReplaceAll" = "Replace All";
// Warning title shown when a file attempting to be copied is too large.
"warningFileTooLargeMessage" = "The file \"%@\" is too large.";
// Warning description shown when a file attempting to be copied is too large.
"warningFileTooLargeInformative" = "Android File Transfer can only transfer files under 4 GB in size";

// Warning shown before deleting files.
"deleteWarningTitle" = "Are you sure you want to permanently delete the selected items?";
// Warning shown when the user is about to do something they might think they can undo, but can't.
"noUndoWarningInformative" = "You can't undo this action";

// Label for the About menu item
"menuAbout" = "About Android File Transfer";
// Label for the Services menu item
"menuServices" = "Services";
// Label for the menu item which hides the application
"menuHide" = "Hide Android File Transfer";
// Label for the menu item which hides the other applications
"menuHideOthers" = "Hide Others";
// Label for the menu item which shows all windows
"menuShowAll" = "Show All";
// Label for the menu item which quits the application
"menuQuit" = "Quit Android File Transfer";

// Label for the File menu
"menuFile" = "File";
// Label for the menu item which creates a new folder
"menuNewFolder" = "New Folder";
// Label for the menu item which closes the window
"menuCloseWindow" = "Close Window";
// Label for the menu item which deletes the selected items
"menuDelete" = "Delete";

// Label for the Go menu
"menuGo" = "Go";
// Label for the menu item which goes back to the previous folder
"menuBack" = "Back";
// Label for the menu item which goes forward to the next folder
"menuForward" = "Forward";
// Label for the menu item which goes to the enclosing folder
"menuEnclosing" = "Enclosing folder";
// Label for the menu item which open the selected
"menuOpenFolder" = "Open folder";

// Label for the Window menu
"menuWindow" = "Window";
// Label for the minimize window menu item
"menuMinimize" = "Minimize";
// Label for the zoom window menu item
"menuZoom" = "Zoom";
// Label for the bring all to front menu item
"menuBringAllToFront" = "Bring All to Front";

// Label for the Help menu
"menuHelp" = "Help";
// Label for the help menu item
"menuHelpItem" = "Android File Transfer Help";

// Title shown on the welcome screen.
"welcomeTitleText" = "Welcome to Android File Transfer";
// Body text of welcome screen.
"welcomeBodyText" = "Connect your Mac to your Android device using its USB cable. Then drag items between the Android File Transfer window and Finder windows. Choose Help > Android File Transfer Help to learn more.\n\nAndroid File Transfer supports Android 3.0 or later.";
// Button on welcome screen which will close the screen, allowing the user to use the application.
"welcomeDoneButtonLabel" = "Get started";

// Message shown in an alert when the user starts the app without any devices.
"noDevicesTitle" = "No Android device found";
// Message shown in an alert when the user starts the app without any devices.
"noDevicesInformative" = "Please connect your Android device with a USB cable to get started.";

// Short file size for folders.
"fileSizeFolder" = "--";
// Short file size for files or transfers under 1 KB.  Placeholder is replaced with the number of bytes of the file.
"fileSizeByte" = "%.0f bytes";
// Short file size for files or transfers under 1 MB.  Placeholder is replaced with the number of kilobytes of the file.
"fileSizeKb" = "%.0f KB";
// Short file size for files or transfers under 1 GB.  Placeholder is replaced with the number of megabytes of the file.
"fileSizeMb" = "%.1f MB";
// Short file size for files or transfers under 1 TB.  Placeholder is replaced with the number of gigabytes of the file.
"fileSizeGb" = "%.2f GB";
// Short file size for files or transfers under 1 PB.  Placeholder is replaced with the number of terabytes of the file.
"fileSizeTb" = "%.3f TB";
// Short file size for files or transfers over 1 PB.  Placeholder is replaced with the number of petabytes of the file.
"fileSizePb" = "%.3f PB";

// The help menu opens the default browser with the following URL
"helpURL" = "http://www.google.com/support/mobile/bin/answer.py?hl=en&answer=1120329";

// Copyright statement at the end to avoid confusing the TC.
/*
   Copyright 2010 Google Inc. All rights reserved.
 */
